Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_container_group.hello_world will be created
+ resource "azurerm_container_group" "hello_world" {
      + dns_name_label              = "cdc-coe-souravb-hello-world"
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "eastus"
      + name                        = "cdc-coe-souravb-hello-world"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "cdc-coe-souravb"
      + restart_policy              = "Always"

      + container {
          + commands = (known after apply)
          + cpu      = 0.5
          + image    = (known after apply)
          + memory   = 1
          + name     = "hello-world"

          + ports {
              + port     = 80
              + protocol = "TCP"
            }
        }

      + image_registry_credential {
          + password = (sensitive value)
          + server   = (known after apply)
          + username = (known after apply)
        }
    }

  # azurerm_container_registry.hello_world will be created
+ resource "azurerm_container_registry" "hello_world" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "CDCSouravBasu"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "cdc-coe-souravb"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_virtual_network.vpc will be created
+ resource "azurerm_virtual_network" "vpc" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "cdc-coe-souravb-network"
      + resource_group_name = "cdc-coe-souravb"
      + subnet              = (known after apply)
    }

  # module.dev.azurerm_kubernetes_cluster.dev will be created
+ resource "azurerm_kubernetes_cluster" "dev" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "cdc-coe-souravb"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "cdc-coe-souravb-cluster"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cdc-coe-souravb"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "cdc-coe-souravb"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile {
          + authorized_ip_ranges     = (known after apply)
          + subnet_id                = (known after apply)
          + vnet_integration_enabled = (known after apply)
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "standard_a2_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip      = (known after apply)
          + docker_bridge_cidr  = (known after apply)
          + ebpf_data_plane     = (known after apply)
          + ip_versions         = (known after apply)
          + load_balancer_sku   = (known after apply)
          + network_mode        = (known after apply)
          + network_plugin      = (known after apply)
          + network_plugin_mode = (known after apply)
          + network_policy      = (known after apply)
          + outbound_type       = (known after apply)
          + pod_cidr            = (known after apply)
          + pod_cidrs           = (known after apply)
          + service_cidr        = (known after apply)
          + service_cidrs       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = (known after apply)
              + managed_outbound_ip_count   = (known after apply)
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ip_address_ids     = (known after apply)
              + outbound_ip_prefix_ids      = (known after apply)
              + outbound_ports_allocated    = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://7f8c865dd844:4141/lock?id=allstacksln%252Fhello-world-azure-acr%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
<details><summary>Log</summary>
  <p>

```
[DBUG] pre-hooks configured, running...
[DBUG] got workspace lock
[INFO] creating dir "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default"
[DBUG] ran: git clone --branch atlantis-test --depth=1 --single-branch https://allstacksln:<redacted>@github.com/allstacksln/hello-world-azure-acr.git /root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default. Output: Cloning into '/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default'...
[DBUG] error: exit status 1: running "/app/tfsec --no-color -f default" in "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default": 

Result #1 CRITICAL Cluster does not limit API access to specific IP addresses. 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-limit-authorized-ips
      Impact Any IP can interact with the API server
  Resolution Limit the access to the API server to a limited IP range

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/limit-authorized-ips/
  - https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/kubernetes_cluster#api_server_authorized_ip_ranges
────────────────────────────────────────────────────────────────────────────────


Result #2 HIGH Cluster has RBAC disabled 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-use-rbac-permissions
      Impact No role based access control is in place for the AKS cluster
  Resolution Enable RBAC

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/use-rbac-permissions/
  - https://www.terraform.io/docs/providers/azurerm/r/kubernetes_cluster.html#role_based_access_control
────────────────────────────────────────────────────────────────────────────────


Result #3 HIGH Kubernetes cluster does not have a network policy set. 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-configured-network-policy
      Impact No network policy is protecting the AKS cluster
  Resolution Configure a network policy

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/configured-network-policy/
  - https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/kubernetes_cluster#network_policy
────────────────────────────────────────────────────────────────────────────────


Result #4 MEDIUM Cluster does not have logging enabled via OMS Agent. 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-logging
      Impact Logging provides valuable information about access and usage
  Resolution Enable logging for AKS

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/logging/
  - https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/kubernetes_cluster#oms_agent
────────────────────────────────────────────────────────────────────────────────


  timings
  ──────────────────────────────────────────
  disk i/o             511.293µs
  parsing              24.058791ms
  adaptation           5.101292ms
  checks               8.551417ms
  total                38.222793ms

  counts
  ──────────────────────────────────────────
  modules downloaded   0
  modules processed    2
  blocks processed     22
  files read           11

  results
  ──────────────────────────────────────────
  passed               2
  ignored              0
  critical             1
  high                 2
  medium               1
  low                  0

  2 passed, 4 potential problem(s) detected.


[EROR] Error running pre-workflow hooks exit status 1: running "/app/tfsec --no-color -f default" in "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default": 

Result #1 CRITICAL Cluster does not limit API access to specific IP addresses. 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-limit-authorized-ips
      Impact Any IP can interact with the API server
  Resolution Limit the access to the API server to a limited IP range

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/limit-authorized-ips/
  - https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/kubernetes_cluster#api_server_authorized_ip_ranges
────────────────────────────────────────────────────────────────────────────────


Result #2 HIGH Cluster has RBAC disabled 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-use-rbac-permissions
      Impact No role based access control is in place for the AKS cluster
  Resolution Enable RBAC

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/use-rbac-permissions/
  - https://www.terraform.io/docs/providers/azurerm/r/kubernetes_cluster.html#role_based_access_control
────────────────────────────────────────────────────────────────────────────────


Result #3 HIGH Kubernetes cluster does not have a network policy set. 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-configured-network-policy
      Impact No network policy is protecting the AKS cluster
  Resolution Configure a network policy

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/configured-network-policy/
  - https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/kubernetes_cluster#network_policy
────────────────────────────────────────────────────────────────────────────────


Result #4 MEDIUM Cluster does not have logging enabled via OMS Agent. 
────────────────────────────────────────────────────────────────────────────────
  terraform/modules/kubernetes_cluster/main.tf:1-22
   via terraform/aks.tf:2-8 (module.dev)
────────────────────────────────────────────────────────────────────────────────
    1  ┌ resource "azurerm_kubernetes_cluster" "dev" {
    2  │   name                = "${var.name}-cluster"
    3  │   location            = var.resource_group_location
    4  │   resource_group_name = var.resource_group_name
    5  │   dns_prefix          = var.name
    6  │ 
    7  │   default_node_pool {
    8  │     name       = "default"
    9  └     node_count = var.node_count
   ..  
────────────────────────────────────────────────────────────────────────────────
          ID azure-container-logging
      Impact Logging provides valuable information about access and usage
  Resolution Enable logging for AKS

  More Information
  - https://aquasecurity.github.io/tfsec/latest/checks/azure/container/logging/
  - https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/kubernetes_cluster#oms_agent
────────────────────────────────────────────────────────────────────────────────


  timings
  ──────────────────────────────────────────
  disk i/o             511.293µs
  parsing              24.058791ms
  adaptation           5.101292ms
  checks               8.551417ms
  total                38.222793ms

  counts
  ──────────────────────────────────────────
  modules downloaded   0
  modules processed    2
  blocks processed     22
  files read           11

  results
  ──────────────────────────────────────────
  passed               2
  ignored              0
  critical             1
  high                 2
  medium               1
  low                  0

  2 passed, 4 potential problem(s) detected.

. Proceeding with plan command.
[DBUG] 4 files were modified in this pull request
[DBUG] got workspace lock
[DBUG] clone directory "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default" already exists, checking if it's at the right commit
[DBUG] repo is at correct commit "9086bd9685b4ef0b6a41f8ae0cc058bcfa5fb138" so will not re-clone
[INFO] found no atlantis.yaml file
[INFO] filtered modified files to 2 .tf or terragrunt.hcl files: [terraform/_config.tf terraform/main.tf]
[INFO] there are 1 modified project(s) at path(s): terraform
[INFO] automatically determined that there were 1 projects modified in this pull request: [repofullname=allstacksln/hello-world-azure-acr path=terraform]
[DBUG] determining config for project at dir: "terraform"
[DBUG] building config based on server-side config
[DBUG] setting delete_source_branch_on_merge: false from repos[1], id: /.*/
[DBUG] setting apply_requirements: [] from default server config
[DBUG] setting workflow: "default" from default server config
[DBUG] setting allowed_overrides: [] from repos[1], id: /.*/
[DBUG] setting allow_custom_workflows: false from repos[1], id: /.*/
[DBUG] Building project command context for plan
[INFO] cannot determine which version to use from terraform configuration, detected 0 possibilities.
[INFO] acquired lock with id "allstacksln/hello-world-azure-acr/terraform/default"
[DBUG] acquired lock for project
[DBUG] clone directory "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default" already exists, checking if it's at the right commit
[DBUG] repo is at correct commit "9086bd9685b4ef0b6a41f8ae0cc058bcfa5fb138" so will not re-clone
[DBUG] starting "/usr/local/bin/terraform init -input=false" in "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default/terraform"
[INFO] successfully ran "/usr/local/bin/terraform init -input=false" in "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default/terraform"
[INFO] successfully ran "/usr/local/bin/terraform workspace show" in "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default/terraform"
[DBUG] starting "/usr/local/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default/terraform/default.tfplan\"" in "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default/terraform"
[INFO] successfully ran "/usr/local/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default/terraform/default.tfplan\"" in "/root/.atlantis/repos/allstacksln/hello-world-azure-acr/2/default/terraform"
```
</p></details>
